
销售数据 = [
      {"订单号": "SO001", "日期": "2026-08-01", "产品": "笔记本电脑", "类别": "电脑整机", "数量": 2, "单价": 5999, "地区": "华东", "销售员": "张伟"},
      {"订单号": "SO002", "日期": "2026-08-01", "产品": "无线鼠标",   "类别": "外设",     "数量": 10, "单价": 89,   "地区": "华北", "销售员": "李娜"},
      {"订单号": "SO003", "日期": "2026-08-02", "产品": "机械键盘",   "类别": "外设",     "数量": 5,  "单价": 359,  "地区": "华东", "销售员": "王芳"},
      {"订单号": "SO004", "日期": "2026-08-02", "产品": "27寸显示器", "类别": "外设",     "数量": 3,  "单价": 1299, "地区": "华南", "销售员": "张伟"},
      {"订单号": "SO005", "日期": "2026-08-03", "产品": "蓝牙耳机",   "类别": "影音",     "数量": 8,  "单价": 499,  "地区": "华北", "销售员": "刘强"},
      {"订单号": "SO006", "日期": "2026-08-03", "产品": "U盘128G",    "类别": "存储",     "数量": 20, "单价": 79,   "地区": "西南", "销售员": "李娜"},
      {"订单号": "SO007", "日期": "2026-08-04", "产品": "移动硬盘2T", "类别": "存储",     "数量": 4,  "单价": 559,  "地区": "华东", "销售员": "陈静"},
      {"订单号": "SO008", "日期": "2026-08-04", "产品": "笔记本电脑", "类别": "电脑整机", "数量": 1,  "单价": 5999, "地区": "华南", "销售员": "王芳"},
      {"订单号": "SO009", "日期": "2026-08-05", "产品": "高清摄像头", "类别": "影音",     "数量": 6,  "单价": 299,  "地区": "华北", "销售员": "刘强"},
      {"订单号": "SO010", "日期": "2026-08-05", "产品": "无线鼠标",   "类别": "外设",     "数量": 15, "单价": 89,   "地区": "西南", "销售员": "陈静"},
  ]

#1. 打印第一条订单的产品名称和单价。
print(f"第一条订单的产品名称是：{销售数据[0]["产品"]}，单价是{销售数据[0]["单价"]}")
#2. 打印第 3 条订单的全部字段，每个字段一行，格式：字段名: 值
for key,value in 销售数据[2].items():
    print(f"{key}:{value}\n")
#3. 计算第一条订单的销售额（数量 × 单价）。答案应该是 11998
销售额=销售数据[0]["数量"]*销售数据[0]["单价"]
print(f"第一条订单销售额是{销售额}")
# 4. 把所有订单的产品名称提取成一个列表并打印（这题先不用去重）。
产品名称=[]
for item in 销售数据:
    产品名称.append(item["产品"])
print(f"所有订单的产品名称是：{产品名称}")
#5. 打印一共有多少条订单记录。
count=0
for dic in 销售数据:
    count+=1
print(f"一共有{count}条订单")

